app/views/restaurants/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 9]]
---

    <% restaurant.reviews.each do |review| %>