app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2016-08-22 16:08:31.565313"], ["updated_at", "2016-08-22 16:08:31.565313"]]
---
  def create
    @restaurant = Restaurant.create(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "restaurants" SET "description" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["description", "cheeky"], ["updated_at", "2016-08-23 13:04:29.133763"], ["id", 1]]
---
  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)